let _rules = {
    //不能为空
    "*" : [new RegExp("[\\w\\W]+"),"不能为空"],
    
    /*  字符串 START
    ............................................................................... */
    //6~16位字符串
    "*6-16" : [new RegExp("^[\\w\\W]{6,16}$"),"长度为6-16位"],
    //0~20位字符串
    "*0-20" : [new RegExp("^[\\w\\W]{0,20}$"),"不能超过20个字符"],
    //0~40位字符串
    "*0-40": [new RegExp("^[\\w\\W]{0,40}$"), "不能超过40个字符"],
    //0~250位字符串
    "*0-250": [new RegExp("^[\\w\\W]{0,250}$"), "不能超过250个字符"],
    //0~1000位字符串
    "*0-1000": [new RegExp("^[\\w\\W]{0,1000}$"), "不能超过1000个字符"],
    //最少30个字符
    "*>=30" : [new RegExp("^[\\w\\W]{30,10000}$"),"不可少于30字"],
    
    /*  字符串 END
    ............................................................................... */
    /*  数字 START
    ............................................................................... */
    //数字、允许小数点、允许负号
    "num" : [new RegExp("^-?\\d+(\\.\\d*)?$"),"必须为数字"],
    "num1-10" : [new RegExp("^(10|[1-9])$"),"必须为1-10之间的正整数"],
    "num0-10" : [new RegExp("^([0-9]|10)$"),"必须为0-10之间的整数"],
    //纯数字（自然数）
    "n" : [new RegExp("^\\d+$"),"必须为纯数字"],
    //3位数字
    "n3" : [new RegExp("^\\d{3}$"),"必须为3位数字"],
    //4位数字
    "n4" : [new RegExp("^\\d{4}$"),"必须为4位数字"],
    //6位数字
    "n6" : [new RegExp("^\\d{6}$"),"必须为6位数字"],
    //6-16位数字
    "n6-16" : [new RegExp("^\\d{6,16}$"),"必须为6-16位数字"],
    
    //最多一位小数的正数
    "f1" : [new RegExp("^\\d+(\\.\\d{1})?$"),"最多一位小数的正数"],
    //最多两位小数的正数
    "f2" : [new RegExp("^([1-9]\\d*|0{1})(\\.\\d{1,2})?$"),"最多两位小数的正数"],
    //最多5位小数的正数
    "f5" : [new RegExp("^([1-9]\\d*|0{1})(\\.\\d{1,5})?$"),"最多5位小数的正数"],
    //最多两位小数的数字
    "f2_all" : [new RegExp("^(\\-)?\\d+(\\.\\d{1,2})?$"),"最多两位小数的数字"],
    //最多四位小数的正数
    "f4" : [new RegExp("^([1-9]\\d*|0{1})(\\.\\d{1,4})?$"),"最多四位小数的正数"],
    //最多六位小数的正数
    "f6" : [new RegExp("^([1-9]\\d*|0{1})(\\.\\d{1,6})?$"),"最多六位小数的正数"],
    //0-1数字、最多一位小数
    "0-1-f1" : [new RegExp("^(0(\\.\\d{1,1})?|0|0.0|1|1.0)$"),"必须为0-1数字且最多包含1位小数"],
    //0-100数字、最多两位小数
    "0-100-f2" : [new RegExp("^(\\d{1,2}(\\.\\d{1,2})?|100|100.0|100.00)$"),"必须为0-100数字且最多包含两位小数"],
    //0-100正整数
    "0-100-n" : [new RegExp("^([0-9]{1,2}|100)$"),"必须为0-100整数"],
    //大于0数字
    'n>0' : [new RegExp("^(?!(0[0-9]{0,}$))[0-9]{1,}[.]{0,}[0-9]{0,}$"),'必须大于0'],
    //大于等于0数字
    "n>=0" : [new RegExp("^\\d+(\\.\\d{0,100})?$"),"必须大于等于0"],
    //不能以数字开头
    "!^n":[new RegExp("[^0-9]"),"不能以数字开头"],
    /*  数字 END
    ............................................................................... */
    /*  其他 START
    ............................................................................... */
    //手机号
    "m" : [new RegExp("^[1]\\d{10}$"),"必须为正确的手机号码格式"],
    //邮箱
    "e" : [new RegExp("^([a-zA-Z0-9_\\.\\-])+\\@(([a-zA-Z0-9\\-])+\\.)+([a-zA-Z0-9]{2,4})?$"),"必须为正确格式"],
    //身份证
    // "idcard":[new RegExp("^[1-9]\\d{7}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{3}$|^[1-9]\\d{5}[1-9]\\d{3}((0\\d)|(1[0-2]))(([0|1|2]\\d)|3[0-1])\\d{3}([0-9]|X)$"),"格式不正确"],
    //字母
    "letter" : [new RegExp("^[a-zA-Z]+$"),"必须为字母"],
    //大写字母
    "LETTER" : [new RegExp("[A-Z]+$"),"必须为大写字母"],
    //数字或字母
    'numLetter' : [new RegExp("^[a-zA-Z0-9]+$"),'只能是数字或字母'],
    //密码
    'psw' : [new RegExp("^(?=.*\\d)(?=.*[a-z])(?=.*[A-Z]).{6,18}$"),'6~18位，且包含数字、大写字母、小写字母，允许特殊字符'],
    /*  其他 END
    ............................................................................... */
    //"e6-20" : [new RegExp("^[a-zA-Z][a-zA-Z0-9]{5,19}"),"必须以字母开头，为6-20位字母和数字"]
    // "url" : [new RegExp("^（\\w+:\\/\\/）？\\w+（\\.\\w+）+.*$"),""],
    //"1-100" : [new RegExp("^\\d{1,2}(\\.\\d{1,2})?$"),"必须为大于0小于100的数字且最多包含两位小数"],
    //'posNum' : [new RegExp("^[1-9]\\d*$"),'为正整数'],
    // "nn" : [new RegExp("^([1-9]\\d*|[0]{1,1})$"),"必须为自然数"],
    // "f5" : [new RegExp("^([1-9]\\d*\\.\\d*|0\\.\\d+|[1-9]\\d*)$"),"为正数"],
    // "s" : [new RegExp("^[\\u4E00-\\u9FA5\\uf900-\\ufa2d\\w\\.\\s]+$"),"必须为字符串"],
    // "s6-18" : [new RegExp("^[\\u4E00-\\u9FA5\\uf900-\\ufa2d\\w\\.\\s]{6,18}$"),""],
    // "p" : [new RegExp("^[0-9]{6}$"),"为正确的密码格式"],
    // "nMaxBankAccount":[new RegExp("^[0-9]+[0-9 -]+(?<![-])$"),"必须为数字、“-”,且不能以 “-” 开头结尾"],// by max 银行卡带- 2020-4-29
    // "nMaxBankAccount2":[new RegExp("^[0-9*-]*$"),"必须为数字、“-”或“*”"],// by max 银行卡带- 2020-5-8
    // "integars" : [new RegExp("^-?\\d+$"),"ID只能为负整数、0、正整数"],
    // "qq" : [new RegExp("^\\d{5,10}$"),"为五到十位的数字"],
    // "id":[new RegExp("(^\\d{15}$)|(^\\d{18}$)|(^\\d{17}(\\d|X|x)$)"),"必须为正确的格式"],
    // "english": [/^[a-zA-Z\u0000-\u00FF]+$/, "必须为英文字母或半角符号"],
    // "loginPsw" : [/^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{8,14}$/,"必须为8-14位英文和数字组合,不支持空格"],
    // "tranPsw" : [/^[^ ]{6,14}$/,"必须为6-14位字符,不支持空格"],//交易
    // "name":[/^[\u4e00-\u9fa5]{1,20}$/,"必须为中文且不能超过20位"],
    // "discount":[ /^([0-9](\.\d)?|10)$/,"必须为0-10之间数值，最多一位小数"],
    // "discount2":[ /^([1-9](\.\d)?|10)$/,"必须为1-10之间数值，最多一位小数"],
    // "account":[/^\w{6,20}$/,"长度为6-20位，只能包含字母、数字和下划线"],
    // "user":[/^[\w\.]{5,30}$/,"长度为5-30位，只能包含字母、数字、小数点和下划线"],
    // "yyyy-mm":[/^\d{4}-\d{2}$/,"必须为yyyy-mm格式"],
    // "fontE":[/^[\u4e00-\u9fa5a-zA-Z][\u4e00-\u9fa5a-zA-Z\d]+$/,"必须以汉字或英文字母开头"],
    // "http":[/^[hH][tT][tT][pP]([sS]?):\/\/(\S+\.)+\S{2,}$/, "必须为正确的格式"],
    // "ID": [/(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}[0-9Xx]$)/, "必须为正确的格式"],
    // "num1-31" : [/^([12][0-9]|31|[1-9])$/,"必须为1-31之间的正整数"],
    // 'posFloat' : [/^([1-9]\d*(\.\d*[1-9][0-9])?)|(0\.\d*[1-9][0-9])|(0\.\d*[1-9])$/,'必须大于0'],
    // 'posFloat2' : [/(^[1-9](\d+)?(\.\d{1,2})?$)|(^\d\.\d{1,2}$)/,'必须大于0，最多两位小数'],
    // 'taxNumber' : [/^[a-zA-Z0-9]{9,}$/,'必须大等于9位的数字或字母'],
  }
  export default _rules;